app/controllers/books_controller.rb

  def create
  	@book = Book.new(book_params)
    if @book.save
      flash[:notice] = "Book was successfully created."
  	  redirect_to book_path(@book)
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "あ"], ["body", "あ"], ["created_at", "2020-05-17 08:39:39.398138"], ["updated_at", "2020-05-17 08:39:39.398138"]]
SELECT "books".* FROM "books"