app/controllers/books_controller.rb

  def new
  	@book = Book.new
    @books = Book.all
---
SELECT "books".* FROM "books"